In [1]:
import pandas as pd
import numpy as np

In [3]:
s1 = pd.Series([1, 2, 3, 4])
s2 = pd.Series([5, 6, 7, 8])
df = pd.DataFrame({"column1": s1, "column2": s2})
df

   column1  column2
0        1        5
1        2        6
2        3        7
3        4        8

In [4]:
df = pd.DataFrame({
    '姓名': ['张三', '李四', '王五', '赵六', '钱七'],
    '数学': [85, 92, 78, 88, 95],
    '英语': [90, 88, 85, 92, 80],
    '物理': [75, 80, 88, 85, 90]
})

df

   姓名  数学  英语  物理
0  张三  85  90  75
1  李四  92  88  80
2  王五  78  85  88
3  赵六  88  92  85
4  钱七  95  80  90

In [33]:
df['total'] = df[['数学', '英语', '物理']].sum(axis=1)
df['avg'] = df[['数学', '英语', '物理']].mean(axis=1)

df[(df['数学']>90) | (df['英语']>85)]

# df.sort_values('total',ascending=False).head(3)

df.nlargest(3, columns='total')

   姓名  数学  英语  物理  total        avg
4  钱七  95  80  90    265  88.333333
3  赵六  88  92  85    265  88.333333
1  李四  92  88  80    260  86.666667

In [35]:
data = {
    '产品名称': ['A', 'B', 'C', 'D'],
    '单价': [100, 150, 200, 120],
    '销量': [50, 30, 20, 40]
}
df = pd.DataFrame(data)
df

  产品名称   单价  销量
0    A  100  50
1    B  150  30
2    C  200  20
3    D  120  40

In [46]:
df['total'] = df['单价'] * df['销量']
df

df.nlargest(1, columns='total')

df.sort_values('total', ascending=False)

  产品名称   单价  销量  total
0    A  100  50   5000
3    D  120  40   4800
1    B  150  30   4500
2    C  200  20   4000

In [48]:
data = {
    '用户ID': [101, 102, 103, 104, 105],
    '用户名': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    '商品类别': ['电子产品', '服饰', '电子产品', '家居', '服饰'],
    '商品单价': [1200, 300, 800, 150, 200],
    '购买数量': [1, 3, 2, 5, 4]
}
df = pd.DataFrame(data)
df

   用户ID      用户名  商品类别  商品单价  购买数量
0   101    Alice  电子产品  1200     1
1   102      Bob    服饰   300     3
2   103  Charlie  电子产品   800     2
3   104    David    家居   150     5
4   105      Eve    服饰   200     4

In [55]:
df['total'] = df['商品单价'] * df['购买数量']
df

   用户ID      用户名  商品类别  商品单价  购买数量  total
0   101    Alice  电子产品  1200     1   1200
1   102      Bob    服饰   300     3    900
2   103  Charlie  电子产品   800     2   1600
3   104    David    家居   150     5    750
4   105      Eve    服饰   200     4    800

In [54]:
df.nlargest(1, columns='total')
df['total'].mean()

np.int64(15)